BennyG9/robot-arm/firmware/arm_stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdarg.h>
#include <string.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Blue_On_Board_Button_Pin GPIO_PIN_13
#define Blue_On_Board_Button_GPIO_Port GPIOC
#define S_Limit_Switch_Pin GPIO_PIN_0
#define S_Limit_Switch_GPIO_Port GPIOC
#define B_Limit_Switch_Pin GPIO_PIN_1
#define B_Limit_Switch_GPIO_Port GPIOC
#define S_ENC_A_Pin GPIO_PIN_0
#define S_ENC_A_GPIO_Port GPIOA
#define S_ENC_B_Pin GPIO_PIN_1
#define S_ENC_B_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define S_MTR_F_Pin GPIO_PIN_6
#define S_MTR_F_GPIO_Port GPIOA
#define S_MTR_B_Pin GPIO_PIN_7
#define S_MTR_B_GPIO_Port GPIOA
#define B_MTR_F_Pin GPIO_PIN_0
#define B_MTR_F_GPIO_Port GPIOB
#define B_MTR_B_Pin GPIO_PIN_1
#define B_MTR_B_GPIO_Port GPIOB
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define B_ENC_B_Pin GPIO_PIN_6
#define B_ENC_B_GPIO_Port GPIOB
#define B_ENC_A_Pin GPIO_PIN_7
#define B_ENC_A_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
